app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT 10 OFFSET 0
---
  def index
    @pagy, @posts = pagy(:offset, Post.order(created_at: :desc), limit: 10)